tutorials/scalar/oscillating_zeroFlux/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

// Doubly periodic 10 x 10 box, 81 x 81 cells, as in the reference notebook
Lx 10; Ly 10; nx 81; ny 81;
dz #eval{ $Lx / $nx };

scale 1;

vertices
(
    (0   0   0)
    ($Lx 0   0)
    ($Lx $Ly 0)
    (0   $Ly 0)
    (0   0   $dz)
    ($Lx 0   $dz)
    ($Lx $Ly $dz)
    (0   $Ly $dz)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny 1) simpleGrading (1 1 1)
);

boundary
(
    left   { type cyclic; neighbourPatch right;  faces ((0 4 7 3)); }
    right  { type cyclic; neighbourPatch left;   faces ((1 2 6 5)); }
    bottom { type cyclic; neighbourPatch top;    faces ((0 1 5 4)); }
    top    { type cyclic; neighbourPatch bottom; faces ((3 7 6 2)); }
    frontAndBack { type empty; faces ((0 3 2 1) (4 5 6 7)); }
);
